{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"home_team_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"home_team_id"},"inbound_nodes":[]},{"name":"away_team_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"away_team_id"},"inbound_nodes":[]},{"name":"league_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"league_id"},"inbound_nodes":[]},{"name":"country_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"country_id"},"inbound_nodes":[]},{"name":"home_team_embedding","class_name":"Embedding","config":{"input_dim":2428,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"home_team_embedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["home_team_id",0,0,{}]]]},{"name":"away_team_embedding","class_name":"Embedding","config":{"input_dim":2428,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"away_team_embedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["away_team_id",0,0,{}]]]},{"name":"league_embedding","class_name":"Embedding","config":{"input_dim":135,"output_dim":20,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"league_embedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["league_id",0,0,{}]]]},{"name":"country_embedding","class_name":"Embedding","config":{"input_dim":133,"output_dim":10,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":1,"name":"country_embedding","trainable":true,"batch_input_shape":[null,1]},"inbound_nodes":[[["country_id",0,0,{}]]]},{"name":"flatten_Flatten21","class_name":"Flatten","config":{"name":"flatten_Flatten21","trainable":true},"inbound_nodes":[[["home_team_embedding",0,0,{}]]]},{"name":"flatten_Flatten22","class_name":"Flatten","config":{"name":"flatten_Flatten22","trainable":true},"inbound_nodes":[[["away_team_embedding",0,0,{}]]]},{"name":"flatten_Flatten23","class_name":"Flatten","config":{"name":"flatten_Flatten23","trainable":true},"inbound_nodes":[[["league_embedding",0,0,{}]]]},{"name":"flatten_Flatten24","class_name":"Flatten","config":{"name":"flatten_Flatten24","trainable":true},"inbound_nodes":[[["country_embedding",0,0,{}]]]},{"name":"numerical_features","class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"name":"numerical_features"},"inbound_nodes":[]},{"name":"concatenate_Concatenate6","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate6","trainable":true},"inbound_nodes":[[["flatten_Flatten21",0,0,{}],["flatten_Flatten22",0,0,{}],["flatten_Flatten23",0,0,{}],["flatten_Flatten24",0,0,{}],["numerical_features",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["concatenate_Concatenate6",0,0,{}]]]},{"name":"dropout_Dropout11","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout11","trainable":true},"inbound_nodes":[[["dense_Dense11",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["dropout_Dropout11",0,0,{}]]]},{"name":"dropout_Dropout12","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout12","trainable":true},"inbound_nodes":[[["dense_Dense12",0,0,{}]]]},{"name":"winner_output","class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"winner_output","trainable":true},"inbound_nodes":[[["dropout_Dropout12",0,0,{}]]]},{"name":"home_points_output","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"home_points_output","trainable":true},"inbound_nodes":[[["dropout_Dropout12",0,0,{}]]]},{"name":"away_points_output","class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"away_points_output","trainable":true},"inbound_nodes":[[["dropout_Dropout12",0,0,{}]]]}],"input_layers":[["home_team_id",0,0],["away_team_id",0,0],["league_id",0,0],["country_id",0,0],["numerical_features",0,0]],"output_layers":[["winner_output",0,0],["home_points_output",0,0],["away_points_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"home_team_embedding/embeddings","shape":[2428,50],"dtype":"float32"},{"name":"away_team_embedding/embeddings","shape":[2428,50],"dtype":"float32"},{"name":"league_embedding/embeddings","shape":[135,20],"dtype":"float32"},{"name":"country_embedding/embeddings","shape":[133,10],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[146,128],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[64],"dtype":"float32"},{"name":"winner_output/kernel","shape":[64,2],"dtype":"float32"},{"name":"winner_output/bias","shape":[2],"dtype":"float32"},{"name":"home_points_output/kernel","shape":[64,1],"dtype":"float32"},{"name":"home_points_output/bias","shape":[1],"dtype":"float32"},{"name":"away_points_output/kernel","shape":[64,1],"dtype":"float32"},{"name":"away_points_output/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}