{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"home_team_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"home_team_id"},"inbound_nodes":[]},{"name":"away_team_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"away_team_id"},"inbound_nodes":[]},{"name":"league_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"league_id"},"inbound_nodes":[]},{"name":"country_id","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"int32","sparse":false,"name":"country_id"},"inbound_nodes":[]},{"name":"home_team_embedding","class_name":"Embedding","config":{"input_dim":3808,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"home_team_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["home_team_id",0,0,{}]]]},{"name":"away_team_embedding","class_name":"Embedding","config":{"input_dim":3808,"output_dim":50,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"away_team_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["away_team_id",0,0,{}]]]},{"name":"league_embedding","class_name":"Embedding","config":{"input_dim":105,"output_dim":20,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"league_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["league_id",0,0,{}]]]},{"name":"country_embedding","class_name":"Embedding","config":{"input_dim":103,"output_dim":10,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"country_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["country_id",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["home_team_embedding",0,0,{}]]]},{"name":"flatten_Flatten2","class_name":"Flatten","config":{"name":"flatten_Flatten2","trainable":true},"inbound_nodes":[[["away_team_embedding",0,0,{}]]]},{"name":"flatten_Flatten3","class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true},"inbound_nodes":[[["league_embedding",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["country_embedding",0,0,{}]]]},{"name":"rating_features","class_name":"InputLayer","config":{"batch_input_shape":[null,78],"dtype":"float32","sparse":false,"name":"rating_features"},"inbound_nodes":[]},{"name":"numerical_features","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"numerical_features"},"inbound_nodes":[]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}],["flatten_Flatten2",0,0,{}],["flatten_Flatten3",0,0,{}],["flatten_Flatten4",0,0,{}],["rating_features",0,0,{}],["numerical_features",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"result_1x2","class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"result_1x2","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"over_under_2_5","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"over_under_2_5","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"btts","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"btts","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"home_score","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"home_score","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"away_score","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"away_score","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]}],"input_layers":[["home_team_id",0,0],["away_team_id",0,0],["league_id",0,0],["country_id",0,0],["rating_features",0,0],["numerical_features",0,0]],"output_layers":[["result_1x2",0,0],["over_under_2_5",0,0],["btts",0,0],["home_score",0,0],["away_score",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"home_team_embedding/embeddings","shape":[3808,50],"dtype":"float32"},{"name":"away_team_embedding/embeddings","shape":[3808,50],"dtype":"float32"},{"name":"league_embedding/embeddings","shape":[105,20],"dtype":"float32"},{"name":"country_embedding/embeddings","shape":[103,10],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[211,128],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[128,64],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[64],"dtype":"float32"},{"name":"result_1x2/kernel","shape":[64,3],"dtype":"float32"},{"name":"result_1x2/bias","shape":[3],"dtype":"float32"},{"name":"over_under_2_5/kernel","shape":[64,1],"dtype":"float32"},{"name":"over_under_2_5/bias","shape":[1],"dtype":"float32"},{"name":"btts/kernel","shape":[64,1],"dtype":"float32"},{"name":"btts/bias","shape":[1],"dtype":"float32"},{"name":"home_score/kernel","shape":[64,1],"dtype":"float32"},{"name":"home_score/bias","shape":[1],"dtype":"float32"},{"name":"away_score/kernel","shape":[64,1],"dtype":"float32"},{"name":"away_score/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}